import styled from "styled-components";
import Task from "./Task";

const Tasks = () => {
    const tasks = [
        { title: "Аналіз та Розслідування Інформаційних Атак", description: "Збір та аналіз даних про інформаційні кампанії, спрямовані на дезінформацію та маніпуляцію громадською думкою. Проведення глибоких розслідувань, ідентифікація джерел фейкових новин, та розробка стратегій для нейтралізації впливу таких кампаній.", percents: "78%" },
        { title: "Розвиток Освітніх Програм", description: "Створення та впровадження освітніх курсів та вебінарів, спрямованих на підвищення обізнаності про методи контрпропаганди, критичне мислення та виявлення фальсифікацій в інформаційному просторі.", percents: "84%" },
        { title: "Створення Бази Даних Фейкових Новин", description: "Розробка та оновлення бази даних, яка включає інформацію про відомі фейкові новини, методи їх розповсюдження та стратегії боротьби з ними. Це включає аналіз візуального контенту, текстових повідомлень, та соціальних мереж.", percents: "91%" },
        { title: "Підтримка Спільноти та Волонтерської Мереж", description: "Створення платформи для залучення волонтерів та фахівців, які займаються контрпропагандою. Організація воркшопів, тренінгів та зустрічей для обміну досвідом, ідей та практиками у сфері боротьби з дезінформацією.", percents: "93%" }
    ]


    return (
        <div className="container">
            <h1 id={'tasks'} style={{ color: 'white', textAlign: 'center', padding: '20px 0' }}>Задачі</h1>
            <TasksContainer>
                {tasks.map((task, index) => (
                    <Task data={task} key={index}></Task>
                ))}
            </TasksContainer>
        </div>
    )
}

const TasksContainer = styled.div`
display: grid;
  grid-template-columns: repeat(2, 700px);
  grid-template-rows: repeat(2, 400px);
  row-gap: 50px;
  background-color: black;
  padding: 0 50px;
  padding-bottom: 40px;
`

export default Tasks;