import styled from "styled-components";
import photo from '../../images/persons/DALL·E 2023-11-16 11.32.05 - Wide-format, realistic style image of a Ukrainian soldier using a radio station while holding a weapon. The soldier is in a field setting, wearing a c.png'
import UncontrolledExample from "./UncontrolledExample";
const About = () => {
    return(
        <AboutContainer>
            <h1 id={'about'}>Про нас</h1>
            <div className={'text'}>
            <p>Інститут має у своєму складі: 3 факультети (9 кафедр), 6 загальновійськових кафедр, науковий центр, Військовий коледж сержантського складу, курси перепідготовки та підвищення кваліфікації: <br/> </p>

               <p>факультет Телекомунікаційних систем; <br/>
                факультет Інформаційних технологій;<br/>
                факультет Бойового застосування систем управління та зв'язку;<br/>
                кафедра Загальновійськових дисциплін;<br/>
                кафедра Фізичного виховання, спеціальної фізичної підготовки і спорту;<br/>
                кафедра Військово-гуманітарних дисциплін;<br/>
                кафедра Математики та фізики;<br/>
                кафедра Іноземних мов;<br/>
                кафедра Військової підготовки;<br/>
                військовий коледж сержантського складу ВІТІ (місце дислокації м. Полтава) ;<br/>
                науковий центр зв'язку та інформатизації;<br/>
                курси перепідготовки та підвищення кваліфікації: <br/> </p>

                <p>В інституті працюють висококваліфіковані науково-педагогічні працівники, серед яких 2 Заслужених діячі науки і техніки України; 1 Заслужений працівник освіти України, 1 Лауреати Державної премії України; 1 Академік галузевої академії; 15 докторів наук; 12 професорів; 61 кандидат наук; 48 доцентів та старших наукових співробітників. <br/> </p>

                <p>У військовому інституті створено всі необхідні умови для здійснення навчально-виховного процесу згідно потреб сучасності: 110 лекційних, навчальних, лабораторних, спеціалізованих аудиторій, комп’ютерних лабораторій, та інших класів; навчально-тренувальний комплекс для відпрацювання питань практичної підготовки курсантів на засобах зв'язку і АСУ; стрілецький тир; 4 спортивні та тренажерні зали; 2 спортивних майданчики, спортивне містечко для занять силовими вправами; смуга перешкод. <br/> </p>

                <p>Випускники інституту отримують диплом державного зразка та первинне офіцерське звання лейтенант. Офіцери випускники направляються для подальшого проходження військової служби до частин та підрозділів Збройних Сил України та інших військових формувань держави. <br/></p>

            <p>Випускники Військового коледжу сержантського складу отримують диплом фахового молодшого баклавра та звійськове вання молодшого сержанта. Випускники направляються для подальшого проходження військової служби до частин та підрозділів Збройних Сил України та інших військових формувань держави, а також можуть продовжити навчання у Військовому інституті за спорідненими спеціальностями для отримання вищих ступенів освіти та військового звання лейтенант. <br/> </p>

            <p>На науковий центр зв’язку та інформатизації покладаються завдання щодо планування, організації і безпосереднього здійснення всіх видів і форм наукової та науково-технічної діяльності з проблем воєнної науки на замовлення (за договорами, оперативними завданнями) органам державної виконавчої влади, структурних підрозділів центрального апарату Міністерства оборони України, Генерального штабу Збройних Сил України і видів Збройних Сил України, органів місцевого самоврядування, підприємств, установ і організацій. Основним напрямом діяльності НЦЗІ ВІТІ є виконання НДДКР, відпрацювання оперативних постановок, наукове супроводження та впровадження результатів дослідно-конструкторських робіт. <br/> </p>

                <p>Курси перепідготовки та підвищення кваліфікації дислокуються на території Військового інституту телекомунікацій та інформатизації підпорядковуються начальнику інституту. Навчання на курсах проводяться, як теоретично в навчальних аудиторіях на кафедрах інституту, де вивчаються новітні засоби зв’язку, так і в польових умовах. Слухачі курсів під керівництвом офіцерів, які неодноразово перебували на Сході України, приймали участь в бойових діях, опановують організацію життєдіяльності у польових умовах та відпрацьовують нормативи по роботі на військовій техніці зв’язку, нормативи з вогневої та інженерної підготовки.</p>
            </div>
            <UncontrolledExample/>
            </AboutContainer>
    )
}
const AboutContainer = styled.div`
  display: flex;
  flex-direction: column;
  color: white;
  justify-content: center;
  align-items: center;
  padding: 0 110px;
  p{
    text-indent: 40px;
  }
  .text{
    text-align: left;
  }
  img{
    width: 100%;
    height: 400px;
    object-fit: cover;
    padding: 40px 0;
  }
`

export default About;